# print("Hello, Python!")
#
# # 주석(commmon): 컴퓨터가 아니라 사람이 읽을 수 있도록 정보를 제공하는 방법으로
# #   주석 처리가 되어있는 부분은 파이썬 인터페이스가 코드로 인지하지 않음
#
# # python: 귀도 반 로섬이라는 네덜라드 출신 개발자가 만든 영어로,
# # C 언어를 기반으로 함.-> 일반도적인 영어를 기준으로 쉽게 프로그램을 작성할 수 있도록
# # 함을 못표로 함->이상의 특징 때문에 많은 사람들이(개발자/비개발자 포함) 파이썬을
# # 학습하게 되었고, 이를 통해 다양한 라이브러리로 확장성이 높앚져
# # 현대에 이르러서는 빅데이터 및 AI, 알고리즘 등을 파이썬으로 구동하는 경우가 많아짐
#
# #  누르고 작성하면  주섭 처리가 됩니다.
# # 여가다가 그냥 작성을 하다가 주석 처리를  해야하는 경우도 있습니다-> ctrk +/
# '''
# 다중 주석 처리
# print("Hello, Python!")이라고 했을 떄 큰 따옴표는 출력되지 않았음을 확인 할 수 있다.
# '''
# print(1)
# print("1")
# '''
# 25번 라인의 출력결과와 26번 라인으로 출력 결과가 동일하기 떄문에 구분이 어려울 수  있습니다.
# 이 때문에  파이썬 사용자에게 필수적인 함수 type()이 있습니다.
# '''
# print(1)  # ctrl + d 눌러보세요
# print("1")  # ctrl _ ㅇ 눌러보세요
#
# # type에 따른 차이 검증
#
# # print(1+2) 결과값 3
# # print(
#
#
# print('''
# 산술
# 1. +:더하기
# 2)
#
# print(3//2) 결과값 1
# print(3/2) rufrhkrkqt 1.5
# print(type(3/2) float
# '''
#       '''
#       변수(variable):데이터(정보)를 담는 바구니
#
#       데이터는 자료형에 따라 결정됩니다/
#       bool:참/거짓
#       int: 정수
#             float:실수
#             staring:문자열
#             '''
# name1 = "김장효"
# name2 = '김장효'
# print(name1)
# print(name2)
# print('''
# 대입 연상자
# 1.=:= 오른쪽에 있는 데이터를= 왼쪽에 있는 변수에 대입한다는 의미)
# 즉, 66번 라인의 해석은 "안근수"라는 staring 타입릐 데이터를 name1이라는 변수에 대입한다는 뜻
#
#     '''
# num = 1
# print(num)
# num = num + 1
# print(num)
#
# '''
#
# 그렇다면 동일하다는 의미를 지닌 =
#
# 다중 staring: 변수명= 한 후에 작은 따웁표 3개 입력하면 자동으로  6개가 나옵나다
# 3개 이후 내용 입력 하면 다중 staring이 적용
# '''
#
# print(introduction)
# name = "김장효"
# job = "대학생"
# age = 21
#
# print(f"제 이름은 {name}이고, 직업은 {job}입니다. 나이는 {age}살 입니다.  내년에는 {age + 1}살이 됩니다.")
# '''
#
# 지금까지 수업한 방식으로는 미리 데이터를  준비해놓고  변수에 대입을 합니다
# 즉 실시간으로 데이터를 입력할 수 없습니다.
#
# 이상의 문제를 해셜하기 위한 방법이 input() 함수입니다
# 커서가 깜빡이는 곳에 이름을 입력하면 종료가 되어버리는 점도 확인 할 수 있습니다
#
# 즉, 데이터를 입력 받기는 했지만 변수에 저장하는 과정리 없었기 때문에 데이터가 휘발됩니다
# '''
# name = input("당신의 이름은 무엇입니까?>>>")
# print(f"제 이름은 {name}입니다")
#
# '''
# age=21
# print(제 이름은 깁장효입니다. 나이는 "+ age ="살입니다."
# f-staring(formatted staring)
'''chapter101_basic_serring 우클릭 ->'''


